Revit 2027 API
ParameterTypeId.FamilyUsePrecutShape Property
 "Show family pre-cut in plan views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyUsePrecutShape { get; }
Public Shared ReadOnly Property FamilyUsePrecutShape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyUsePrecutShape {
	ForgeTypeId^ get ();
}
static member FamilyUsePrecutShape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace